Revit 2026 API

# BendingDetailCustomFieldProperties Methods

---

The BendingDetailCustomFieldProperties type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AreEqualTo | Identifies if the custom field properties are equal or not. |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

BendingDetailCustomFieldProperties Class

Autodesk.Revit.DB.Structure Namespace